package main

import "fmt"

// https://github.com/qcrao/Go-Questions/blob/master/%E6%95%B0%E7%BB%84%E5%92%8C%E5%88%87%E7%89%87/%E6%95%B0%E7%BB%84%E5%92%8C%E5%88%87%E7%89%87%E6%9C%89%E4%BB%80%E4%B9%88%E5%BC%82%E5%90%8C.md

func main() {
	slice := []int{0, 1, 2, 3, 4, 5, 6, 7, 8, 9}
	s1 := slice[2:5] // 2,3,4,容量默认到数组结尾，即2-9，为8 （默认不是slice的容量）
	s2 := s1[2:6:7]  // 7: 指定容量到索引7（开区间，实际到6），因此容量为5（2-6），2:6为值得范围s1[2:6],即4,5,6,7

	s2 = append(s2, 100) // 容量够用，直接追加，4,5,6,7,100，这会导致原数组改变，即100代替8
	s2 = append(s2, 200) // 4,5,6,7,100,200 容量不够（另起炉灶，不在使用原数组），并且原容量为5，小于1024，于是容量乘以2，为10。

	s1[2] = 20 // 2,3,20

	fmt.Println(s1)    // [2 3 20]
	fmt.Println(s2)    // [4 5 6 7 100 200]
	fmt.Println(slice) // [0 1 2 3 20 5 6 7 100 9]
}
